cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

brew 'bottom'
brew 'cmake'
brew 'fzf'
brew 'jq'
brew 'lazygit'
brew 'llvm'
brew 'lmod'
brew 'make'
brew 'micromamba'
brew 'neovim'
brew 'node'
brew 'postgresql@14'
brew 'ripgrep'
brew 'rust'
brew 'tmux'
brew 'tree'
brew 'wget'

cask 'alacritty'
cask 'firefox'
cask 'font-fira-code-nerd-font'
cask 'visual-studio-code'

